## Pandas
* Pandas is opensource library that allows to perform data manipulation(Series,DataFrames)
* Derived from PANel Data

## Why use pandas
* to handle missing data
* Efficient way to slice the data
* flexible way to merge,concatenate and reshape data

## Data structures
* Series
* DataFrames

## Series
* It is one dimensional data

In [3]:
import pandas as pd
pd.Series([1,2,3],index=[1,2,3])

1    1
2    2
3    3
dtype: int64

In [4]:
d1=pd.Series(['vidya',28,'cse',1,2],index=[1,2,3,4,5])

In [5]:
d1

1    vidya
2       28
3      cse
4        1
5        2
dtype: object

In [11]:
d1[:]

1    vidya
2       28
3      cse
4        1
5        2
dtype: object

In [12]:
d1[0:3]

1    vidya
2       28
3      cse
dtype: object

In [6]:
#Cube values
import pandas as pd
n=int(input("enter number"))
s=[i**3 for i in range(1,n+1)]
index=[j for j in range(1,n+1)]
pd.Series(s,index)

enter number5

1      1
2      8
3     27
4     64
5    125
dtype: int64

## DataFrame
* Two dimensional array

In [14]:
# using List
import pandas as pd
df=[['vidya','28','cse'],['anu','40','civil']]
df1=pd.DataFrame(df,columns=['Name','Rollnumber','branch'])
df1

    Name Rollnumber branch
0  vidya         28    cse
1    anu         40  civil

In [17]:
#using Dictionary
info={'Name':'vidya','clg':'gec','branch':'cse','rollno':528}
data={'Name':'anu','clg':'gec','branch':'civil'}
details={'Name':'rockey','clg':'vrsec','branch':'mech'}
s=pd.DataFrame([info,data,details],index=['TrainerName','College','Designation'])
#s.head()
s

               Name    clg branch  rollno
TrainerName   vidya    gec    cse   528.0
College         anu    gec  civil     NaN
Designation  rockey  vrsec   mech     NaN

In [48]:
#loc--->to give index data
#ilic---->to give index value
s.loc['College']

Name        anu
branch    civil
clg         gec
rollno      NaN
Name: College, dtype: object

In [51]:
s.iloc[0]

Name      vidya
branch      cse
clg         gec
rollno      528
Name: TrainerName, dtype: object

In [52]:
s.iloc[1]

Name        anu
branch    civil
clg         gec
rollno      NaN
Name: College, dtype: object

In [53]:
s.iloc[2]

Name      rockey
branch      mech
clg        vrsec
rollno       NaN
Name: Designation, dtype: object

In [54]:
s['gender']='female'

In [55]:
s

               Name branch    clg  rollno  gender
TrainerName   vidya    cse    gec   528.0  female
College         anu  civil    gec     NaN  female
Designation  rockey   mech  vrsec     NaN  female

In [56]:
s.T

       TrainerName College Designation
Name         vidya     anu      rockey
branch         cse   civil        mech
clg            gec     gec       vrsec
rollno         528     NaN         NaN
gender      female  female      female

In [57]:
s.T.loc['clg']

TrainerName      gec
College          gec
Designation    vrsec
Name: clg, dtype: object

In [59]:
s.T.iloc[3]

TrainerName    528
College        NaN
Designation    NaN
Name: rollno, dtype: object